app/controllers/cities_controller.rb

  def downgrade_to_settlement
    @city = @player.cities.find(params[:id])
---
SELECT * FROM "cities" WHERE ("cities"."id" = 1)

  def load_player
    @player = Player.find(params[:player_id])
---
SELECT * FROM "players" WHERE ("players"."id" = 1)