app/controllers/games_controller.rb

SELECT "cities".* FROM "cities" WHERE ("cities".player_id = 1)
SELECT "knights".* FROM "knights" WHERE ("knights".player_id = 1)
SELECT "largest_armies".* FROM "largest_armies" WHERE ("largest_armies".game_id = 1)
SELECT "longest_roads".* FROM "longest_roads" WHERE ("longest_roads".game_id = 1)
---
  def show
    @game = Game.find(params[:id], :include => [:largest_army, :longest_road, {:players => [:settlements, :cities, :knights, :soldiers]}])

INSERT INTO "games" ("created_at", "updated_at", "victory_points_to_win") VALUES('2009-11-26 21:46:35', '2009-11-26 21:46:35', 10)
---
  def create
    # get players_attributes because game needs to be saved before adding players.
    players_attributes = params[:game].delete(:players_attributes)
    game = Game.new(params[:game])
    game.save!

SELECT * FROM "games" WHERE ("games"."id" = 1)
UPDATE "games" SET "updated_at" = '2009-11-26 21:46:35', "victory_points_to_win" = 13 WHERE "id" = 1
---
  def update
    game = Game.find(params[:id])
    game.update_attributes! params[:game]