app/controllers/knights_controller.rb

INSERT INTO "knights" ("created_at", "updated_at", "level", "player_id", "activated") VALUES('2009-11-26 21:46:35', '2009-11-26 21:46:35', 1, 1, 'f')
---
  def create
    @knight = @player.knights.create!(:level => 1)

SELECT * FROM "knights" WHERE ("knights"."id" = 1)
DELETE FROM "knights" WHERE "id" = 1
---
  def destroy
    @knight = @player.knights.find(params[:id])
    @knight.destroy

SELECT * FROM "knights" WHERE ("knights"."id" = 1)
---
  def promote
    @knight = @player.knights.find(params[:id])

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def load_player
    @player = Player.find(params[:player_id])