app/controllers/players_controller.rb

SELECT * FROM "players" WHERE ("players"."id" = 2)
---
  def take_longest_road
    player = Player.find(params[:id])

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def play_soldier
    player = Player.find(params[:id])

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def build_metropolis
    player = Player.find(params[:id])

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def take_boot
    player = Player.find(params[:id])

SELECT * FROM "players" WHERE ("players"."id" = 1)
---
  def take_progress_card_victory_point
    player = Player.find(params[:id])