app/controllers/settlements_controller.rb

  def create
    @player.settlements.create!
---
INSERT INTO "settlements" ("created_at", "updated_at", "player_id") VALUES('2009-11-26 21:46:36', '2009-11-26 21:46:36', 1)

  def upgrade_to_city
    @settlement = Settlement.find(params[:id])
---
SELECT * FROM "settlements" WHERE ("settlements"."id" = 1)

  def destroy
    settlement = Settlement.find(params[:id])
    settlement.destroy
---
SELECT * FROM "settlements" WHERE ("settlements"."id" = 3)
DELETE FROM "settlements" WHERE "id" = 3

  def load_player
    @player = Player.find(params[:player_id])
---
SELECT * FROM "players" WHERE ("players"."id" = 1)